Reports/ОстаткиТоваровОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОстаткиТоваровОтчет</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Характеристики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/ОстаткиТоваровОтчет/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаОкончания = КонецДня(ТекущаяДата());
	ДатаНачала = НачалоДня(ДобавитьМесяц(ДатаОкончания, -1));
	ЗначениеВРеквизитФормы(ИнициализироватьТаблицуРезультата(), "РезультатОтчета");
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	ТаблицаРезультата = ПолучитьДанныеОтчета();
	ЗначениеВРеквизитФормы(ТаблицаРезультата, "РезультатОтчета");
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеОтчета()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(Остатки.Номенклатура) КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(Остатки.Характеристика) КАК Характеристика,
	|	Остатки.КоличествоНачальныйОстаток КАК НачальныйОстаток,
	|	Остатки.КоличествоПриход КАК Приход,
	|	Остатки.КоличествоРасход КАК Расход,
	|	Остатки.КоличествоКонечныйОстаток КАК КонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваров.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, , ) КАК Остатки";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	ТаблицаРезультата.Сортировать("Номенклатура, Характеристика");
	Возврат ТаблицаРезультата;
КонецФункции

&НаСервереБезКонтекста
Функция ИнициализироватьТаблицуРезультата()
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150)));
	ТаблицаРезультата.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150)));
	ТаблицаРезультата.Колонки.Добавить("НачальныйОстаток", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	ТаблицаРезультата.Колонки.Добавить("Приход", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	ТаблицаРезультата.Колонки.Добавить("Расход", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	ТаблицаРезультата.Колонки.Добавить("КонечныйОстаток", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	Возврат ТаблицаРезультата;
КонецФункции
